Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_tim.h
/** @defgroup TIM_Output_Compare_and_PWM_modes TIM Output Compare and PWM Modes
  * @{
  */
#define TIM_OCMODE_TIMING                   0x00000000U                                                                 /*!< Frozen                                 */
#define TIM_OCMODE_ACTIVE                   (                                                         TIM_CCMR1_OC1M_0) /*!< Set channel to active level on match   */
#define TIM_OCMODE_INACTIVE                 (                                      TIM_CCMR1_OC1M_1                   ) /*!< Set channel to inactive level on match */
#define TIM_OCMODE_TOGGLE                   (                                      TIM_CCMR1_OC1M_1 | TIM_CCMR1_OC1M_0) /*!< Toggle                                 */
#define TIM_OCMODE_PWM1                     (                   TIM_CCMR1_OC1M_2 | TIM_CCMR1_OC1M_1                   ) /*!< PWM mode 1                             */
#define TIM_OCMODE_PWM2                     (                   TIM_CCMR1_OC1M_2 | TIM_CCMR1_OC1M_1 | TIM_CCMR1_OC1M_0) /*!< PWM mode 2                             */
#define TIM_OCMODE_FORCED_ACTIVE            (                   TIM_CCMR1_OC1M_2                    | TIM_CCMR1_OC1M_0) /*!< Force active level                     */
#define TIM_OCMODE_FORCED_INACTIVE          (                   TIM_CCMR1_OC1M_2                                      ) /*!< Force inactive level                   */
#define TIM_OCMODE_RETRIGERRABLE_OPM1       (TIM_CCMR1_OC1M_3                                                         ) /*!< Retrigerrable OPM mode 1               */
#define TIM_OCMODE_RETRIGERRABLE_OPM2       (TIM_CCMR1_OC1M_3                                       | TIM_CCMR1_OC1M_0) /*!< Retrigerrable OPM mode 2               */
#define TIM_OCMODE_COMBINED_PWM1            (TIM_CCMR1_OC1M_3 | TIM_CCMR1_OC1M_2                                      ) /*!< Combined PWM mode 1                    */
#define TIM_OCMODE_COMBINED_PWM2            (TIM_CCMR1_OC1M_3 | TIM_CCMR1_OC1M_2                    | TIM_CCMR1_OC1M_0) /*!< Combined PWM mode 2                    */
#define TIM_OCMODE_ASYMMETRIC_PWM1          (TIM_CCMR1_OC1M_3 | TIM_CCMR1_OC1M_2                    | TIM_CCMR1_OC1M_1) /*!< Asymmetric PWM mode 1                  */
#define TIM_OCMODE_ASYMMETRIC_PWM2          (TIM_CCMR1_OC1M                                                           ) /*!< Asymmetric PWM mode 2                  */
#define TIM_OCMODE_PULSE_ON_COMPARE         (TIM_CCMR2_OC3M_3                    | TIM_CCMR2_OC3M_1                   ) /*!< Pulse on compare (CH3&CH4 only)        */
#define TIM_OCMODE_DIRECTION_OUTPUT         (TIM_CCMR2_OC3M_3                    | TIM_CCMR2_OC3M_1 | TIM_CCMR2_OC3M_0) /*!< Direction output (CH3&CH4 only)        */
/**
  * @}
  */

/** @defgroup TIM_Trigger_Selection TIM Trigger Selection
  * @{
  */
#define TIM_TS_ITR0          (0x00000000U)                                                                     /*!< Internal Trigger 0 (ITR0)              */
#define TIM_TS_ITR1          (TIM_SMCR_TS_0                                                                 )  /*!< Internal Trigger 1 (ITR1)              */
#define TIM_TS_ITR2          (                TIM_SMCR_TS_1                                                 )  /*!< Internal Trigger 2 (ITR2)              */
#define TIM_TS_ITR3          (TIM_SMCR_TS_0 | TIM_SMCR_TS_1                                                 )  /*!< Internal Trigger 3 (ITR3)              */
#define TIM_TS_TI1F_ED       (                                TIM_SMCR_TS_2                                 )  /*!< TI1 Edge Detector (TI1F_ED)            */
#define TIM_TS_TI1FP1        (TIM_SMCR_TS_0                 | TIM_SMCR_TS_2                                 )  /*!< Filtered Timer Input 1 (TI1FP1)        */
#define TIM_TS_TI2FP2        (                TIM_SMCR_TS_1 | TIM_SMCR_TS_2                                 )  /*!< Filtered Timer Input 2 (TI2FP2)        */
#define TIM_TS_ETRF          (TIM_SMCR_TS_0 | TIM_SMCR_TS_1 | TIM_SMCR_TS_2                                 )  /*!< Filtered External Trigger input (ETRF) */
#define TIM_TS_ITR4          TIM_SMCR_TS_3                                                                     /*!< Internal Trigger 4 (ITR9)              */
#define TIM_TS_ITR5          (TIM_SMCR_TS_0                                 | TIM_SMCR_TS_3                 )  /*!< Internal Trigger 5 (ITR5)              */
#define TIM_TS_ITR6          (                TIM_SMCR_TS_1                 | TIM_SMCR_TS_3                 )  /*!< Internal Trigger 6 (ITR6)              */
#define TIM_TS_ITR7          (TIM_SMCR_TS_0 | TIM_SMCR_TS_1                 | TIM_SMCR_TS_3                 )  /*!< Internal Trigger 7 (ITR7)              */
#define TIM_TS_ITR8          (                                TIM_SMCR_TS_2 | TIM_SMCR_TS_3                 )  /*!< Internal Trigger 8 (ITR8)              */
#define TIM_TS_ITR9          (TIM_SMCR_TS_0                 | TIM_SMCR_TS_2 | TIM_SMCR_TS_3                 )  /*!< Internal Trigger 9 (ITR9)              */
#define TIM_TS_ITR10         (                TIM_SMCR_TS_1 | TIM_SMCR_TS_2 | TIM_SMCR_TS_3                 )  /*!< Internal Trigger 10 (ITR10)            */
#define TIM_TS_ITR11         (TIM_SMCR_TS_0 | TIM_SMCR_TS_1 | TIM_SMCR_TS_2 | TIM_SMCR_TS_3                 )  /*!< Internal Trigger 11 (ITR11)            */
#define TIM_TS_ITR12         (                                                                 TIM_SMCR_TS_4)  /*!< Internal Trigger 12 (ITR12)            */
#define TIM_TS_ITR13         (TIM_SMCR_TS_0                                                  | TIM_SMCR_TS_4)  /*!< Internal Trigger 13 (ITR13)            */
#define TIM_TS_ITR14         (                TIM_SMCR_TS_1                                  | TIM_SMCR_TS_4)  /*!< Internal Trigger 14 (ITR14)            */
#define TIM_TS_ITR15         (TIM_SMCR_TS_0 | TIM_SMCR_TS_1                                  | TIM_SMCR_TS_4)  /*!< Internal Trigger 15 (ITR15)            */
#define TIM_TS_ITR16         (                                TIM_SMCR_TS_2                  | TIM_SMCR_TS_4)  /*!< Internal Trigger 16 (ITR16)            */
#define TIM_TS_ITR17         (TIM_SMCR_TS_0                 | TIM_SMCR_TS_2                  | TIM_SMCR_TS_4)  /*!< Internal Trigger 17 (ITR17)            */
#define TIM_TS_ITR18         (                TIM_SMCR_TS_1 | TIM_SMCR_TS_2                  | TIM_SMCR_TS_4)  /*!< Internal Trigger 18 (ITR18)            */

